---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.Insert(Autodesk.Revit.DB.DimensionSegment,System.Int32)
source: html/6e0e8c14-5ba1-35e1-c486-5282743ee680.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.Insert Method

Insert the specified item into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	DimensionSegment item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.DimensionSegment`) - The item to be inserted into the array.
- **index** (`System.Int32`) - The item will be inserted before this index.

## Returns
Returns whether the item was inserted into the array.